### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_monitor_diagnostic_setting.queue_diagnostic_setting will be created
  + resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.OperationalInsights/workspaces/io-p-law-common"
      + name                           = "io-p-cdc-st-queue-ds-01"
      + target_resource_id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncdcbest01/queueServices/default"

      + enabled_log {
          + category       = "StorageWrite"
            # (1 unchanged attribute hidden)
        }

      + enabled_metric (known after apply)

      + metric {
          + category = "Capacity"
          + enabled  = false
        }
      + metric {
          + category = "Transaction"
          + enabled  = false
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.card_request_poison_alert_rule will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "card_request_poison_alert_rule" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Permanent failures processing CardRequest. REQUIRED MANUAL ACTION"
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CDC | iopitncdcbest01] Failures on card-request-poison"
      + resource_group_name                    = "io-p-itn-cdc-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncdcbest01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CDC"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CDC"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cdc-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                StorageQueueLogs
                  | where OperationName has "PutMessage"
                  | where Uri has "card-request-poison"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cdc_authorize_failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cdc_authorize_failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "There have been some failures on /api/cdc/v1/authorize, citizens are being impacted."
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CDC | AppIO] Authorize failed"
      + resource_group_name                    = "io-p-itn-cdc-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CDC"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CDC"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cdc-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                  | where originalHost_s in (datatable (name: string) ["api-app.io.pagopa.it"])
                  | where requestUri_s matches regex "/api/cdc/v1/authorize"
                  | where httpStatus_d >= 400
            EOT
          + threshold               = 1
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cdc_fims_auth_failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cdc_fims_auth_failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "There have been some failures on /api/cdc/v1/fauth, citizens are being impacted."
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CDC | AppIO] FIMS auth failed"
      + resource_group_name                    = "io-p-itn-cdc-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CDC"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CDC"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cdc-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                  | where originalHost_s in (datatable (name: string) ["api-app.io.pagopa.it"])
                  | where requestUri_s matches regex "/api/cdc/v1/fauth"
                  | where httpStatus_d >= 400
            EOT
          + threshold               = 1
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cdc_fims_callback_failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cdc_fims_callback_failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "There have been some failures on /api/cdc/v1/fcb, citizens are being impacted."
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CDC | AppIO] FIMS callback failed"
      + resource_group_name                    = "io-p-itn-cdc-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CDC"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CDC"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cdc-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                  | where originalHost_s in (datatable (name: string) ["api-app.io.pagopa.it"])
                  | where requestUri_s matches regex "/api/cdc/v1/fcb"
                  | where httpStatus_d >= 400
            EOT
          + threshold               = 1
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cdc_get_card_requests_failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cdc_get_card_requests_failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "There have been some failures on GET /api/cdc/v1/card-requests, citizens are being impacted."
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CDC | AppIO] GET card request failed"
      + resource_group_name                    = "io-p-itn-cdc-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CDC"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CDC"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cdc-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                  | where originalHost_s in (datatable (name: string) ["api-app.io.pagopa.it"])
                  | where requestUri_s matches regex "/api/cdc/v1/card-requests"
                  | where httpMethod_s == 'GET'
                  | where httpStatus_d >= 400
            EOT
          + threshold               = 1
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cdc_post_card_requests_failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cdc_post_card_requests_failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "There have been some failures on POST /api/cdc/v1/card-requests, citizens are being impacted."
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CDC | AppIO] POST card request failed"
      + resource_group_name                    = "io-p-itn-cdc-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CDC"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CDC"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cdc-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                  | where originalHost_s in (datatable (name: string) ["api-app.io.pagopa.it"])
                  | where requestUri_s matches regex "/api/cdc/v1/card-requests"
                  | where httpMethod_s == 'POST'
                  | where httpStatus_d >= 400
            EOT
          + threshold               = 1
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cdc_process_pending_request_failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cdc_process_pending_request_failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Queue fired ProcessPendingRequest job has failed."
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CDC | Queue Jobs] ProcessPendingRequest failed"
      + resource_group_name                    = "io-p-itn-cdc-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CDC"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CDC"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cdc-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                requests
                  | where cloud_RoleName == 'io-p-itn-cdc-backend-func-01'
                  | where success == false
                  | where operation_Name =~ 'ProcessPendingRequest'
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cdc_years_failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cdc_years_failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "There have been some failures on /api/cdc/v1/years, citizens are being impacted."
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CDC | AppIO] Years failed"
      + resource_group_name                    = "io-p-itn-cdc-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CDC"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CDC"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cdc-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                  | where originalHost_s in (datatable (name: string) ["api-app.io.pagopa.it"])
                  | where requestUri_s matches regex "/api/cdc/v1/years"
                  | where httpStatus_d >= 400
            EOT
          + threshold               = 1
          + time_aggregation_method = "Count"
        }
    }

  # module.backend_func.module.cdc_backend_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "AzureWebJobs.ProcessPendingRequest.Disabled"                                                      = "0" -> null
            # (52 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Web/sites/io-p-itn-cdc-backend-func-01"
        name                                           = "io-p-itn-cdc-backend-func-01"
        tags                                           = {
            "BusinessUnit"                                   = "CDC"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CDC"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 9 to add, 1 to change, 0 to destroy.
```

</details>
